Revit 2027 API
DGNExportOptions.FileVersion Property
 The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DGNFileFormat FileVersion { get; set; }
Public Property FileVersion As DGNFileFormat
	Get
	Set
public:
property DGNFileFormat FileVersion {
	DGNFileFormat get ();
	void set (DGNFileFormat value);
}
member FileVersion : DGNFileFormat with get, set
Property Value
DGNFileFormat
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace